private-events/app/controllers/events_controller.rb

  def create
    current_user.events.create(events_params)
---
INSERT INTO "events" ("creator_id", "title", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)